"CIAdditionCompositing" = "Lisäys";
"CIAffineClamp" = "Affiinipidike";
"CIAffineTile" = "Affiinitiili";
"CIAffineTransform" = "Affiinimuunnos";
"CIBarsSwipeTransition"="Palkkipyyhkäisysiirros";
"CIBlendWithMask" = "Sekoitus maskilla";
"CIBloom" = "Kukinta";
"CIBoxBlur"="Laatikkosumennus";
"CIBumpDistortion" = "Pinnanvääristymä";
"CIBumpDistortionLinear"="Kuplavääristymä lineaarinen";
"CICMYKHalftone" = "CMYK-puolisävy";
"CICheckerboardGenerator" = "Shakkiruutu";
"CICircleSplashDistortion" = "Rengasaaltovääristymä";
"CICircularScreen" = "Pyöreä ruutu";
"CICircularWrap" = "Pallovääristymä";
"CIColorControls" = "Värisäätimet";
"CIColorCube" = "Värikuutio";
"CIColorInvert" = "Värinkääntö";
"CIColorMap" = "Värinkartoitus";
"CIColorMatrix" = "Värimatriisi";
"CIColorMonochrome" = "Yksivärinen";
"CIColorPosterize" = "Värin porrastus";
"CIComicEffect" = "Sarjakuvatehoste";
"CIConstantColorGenerator" = "Vakioväri";
"CICopyMachineTransition" = "Kopiokone";
"CICrop" = "Rajaa";
"CICrystallize" = "Kristalloi";
"CIDiscBlur"="Kiekkosumennus";
"CIDisintegrateWithMaskTransition" = "Hajotus maskilla";
"CIDisplacementDistortion" = "Siirtymävääristymä";
"CIDissolveTransition" = "Hajonta";
"CIDotScreen" = "Pistenäyttö";
"CIEdges" = "Reunat";
"CIEdgeWork" = "Reunatyö";
"CIEightfoldReflectedTile"="8-kertainen heijastunut tiili";
"CIExposureAdjust" = "Valotuksen säätö";
"CIFalseColor" = "Vääräväri";
"CIFastBoxBlur" = "Nopea laatikkosumennus";
"CIFastDiscBlur" = "Nopea kiekkosumennus";
"CIFlashTransition" = "Salama";
"CIFourfoldReflectedTile"="4-kertainen heijastunut tiili";
"CIFourfoldRotatedTile"="4-kertainen pyöritetty tiili";
"CIFourfoldTranslatedTile"="4-kertainen käännetty tiili";
"CIGammaAdjust" = "Gamman säätö";
"CIGaussianBlur" = "Gauss-sumennus";
"CIGaussianGradient" = "Gauss-gradientti";
"CIGlassDistortion" = "Lasivääristymä";
"CIGlassLozenge" = "Lasivinoneliö";
"CIGlideReflectedTile"="Liukuva heijastettu tiili";
"CIGloom" = "Synkkä";
"CIHatchedScreen" = "Kuoriutunut näyttö";
"CIHeightFieldFromMask" = "Korkeuskenttä maskista";
"CIHexagonalPixellate"="Kuusikulmainen pikselöinti";
"CIHoleDistortion" = "Reikävääristymä";
"CIHueAdjust" = "Sävynsäätö";
"CIKaleidoscope" = "Kaleidoskooppi";
"CILanczosScaleTransform" = "Lanczosin skaalamuunnos";
"CILenticularHaloGenerator" = "Linssimäinen sädekehä";
"CILineOverlay" = "Viivapeitto";
"CILineScreen" = "Viivanäyttö";
"CILinearGradient" = "Lineaarigradientti";
"CIMaskToAlpha" = "Maskaus alfalla";
"CIMaximumCompositing" = "Maksimi";
"CIMedianFilter" = "Mediaani";
"CIMinimumCompositing" = "Minimi";
"CIModTransition" = "Mod";
"CIMotionBlur" = "Liikesumennus";
"CIMultiplyCompositing" = "Kerro";
"CINoiseReduction" = "Kohinan vaimennus";
"CIOpTile" = "Op-tiili";
"CIPageCurlTransition" = "Sivunkääntö";
"CIParallelogramTile" = "Suunnikastiili";
"CIPerspectiveTile" = "Perspektiivitiili";
"CIPerspectiveTransform" = "Perspektiivimuunnos";
"CIPinchDistortion" = "Keskipistevääristymä";
"CIPixellate" = "Pikselöinti";
"CIPointillize" = "Pisteellistäminen";
"CIRadialGradient" = "Radiaaligradientti";
"CIRandomGenerator" = "Satunnaisgeneraattori";
"CIRippleTransition" = "Väreily";
"CISepiaTone" = "Seepiasävy";
"CIShadedMaterial" = "Varjostettu materiaali";
"CISharpenLuminance" = "Hohdon terävöitys";
"CISixfoldReflectedTile"="6-kertainen heijastettu tiili";
"CISixfoldRotatedTile"="6-kertainen pyöritetty tiili";
"CISourceAtopCompositing" = "Lähde huipulla";
"CISourceInCompositing" = "Lähde sisällä";
"CISourceOutCompositing" = "Lähde ulkona";
"CISourceOverCompositing" = "Lähde päällä";
"CISpotColor" = "Spottiväri";
"CISpotLight" = "Kohdevalo";
"CIStarShineGenerator" = "Tähtisäihke";
"CIStripesGenerator" = "Raidat";
"CISunbeamsGenerator" = "Auringonsäteet";
"CISwipeTransition" = "Pyyhkäisy";
"CITorusLensDistortion" = "Toroidinen linssivääristymä";
"CITriangleTile" = "Kolmiotiili";
"CITwelvefoldReflectedTile"="12-kertainen heijastettu tiili";
"CITwirlDistortion" = "Spiraalivääristymä";
"CIUnsharpMask" = "Epäterävä maski";
"CIVortexDistortion" = "Pyörrevääristymä";
"CIWhitePointAdjust" = "Valkopisteen säätö";
"CIZoomBlur" = "Zoomaussumennus";
"CIColorBlendMode" = "Värinsekoitustila";
"CIColorBurnBlendMode" = "Värinpolton sekoitustila";
"CIColorDodgeBlendMode" = "Värinsiirtymän sekoitustila";
"CIDarkenBlendMode" = "Tummentava sekoitustila";
"CIDifferenceBlendMode" = "Erotuksen sekoitustila";
"CIExclusionBlendMode" = "Poissulkeva sekoitustila";
"CIHardLightBlendMode" = "Kovavaloinen sekoitustila";
"CIHueBlendMode" = "Sävynsekoitustila";
"CILightenBlendMode" = "Vaalentava sekoitustila";
"CILuminosityBlendMode" = "Hohtava sekoitustila";
"CIMultiplyBlendMode" = "Kerronnan sekoitustila";
"CIOverlayBlendMode" = "Pintakerroksen sekoitustila";
"CISaturationBlendMode" = "Kylläisyyden sekoitustila";
"CIScreenBlendMode" = "Näytönsekoitustila";
"CISoftLightBlendMode" = "Pehmeävaloinen sekoitustila";
"CIAreaHistogram" = "Aluehistogrammi";
"CIAreaMaximum" = "Aluemaksimi";
"CIAreaMinimum" = "Alueminimi";
"CIAreaMaximumAlpha" = "Alueen maksimialfa";
"CIAreaMinimumAlpha" = "Alueen minimialfa";
"CIAreaAverage" = "Aluekeskiarvo";
"CIRowAverage" = "Rivin keskiarvo";
"CIColumnAverage" = "Sarakkeen keskiarvo";
"CIMinimumComponent" = "Minimikomponentti";
"CIMaximumComponent" = "Maksimikomponentti";
